from django.core.management.base import BaseCommand
from honey.models import Honey
import random

class Command(BaseCommand):
    help = 'Генерирует тестовые данные'

    def handle(self, *args, **options):
        types = ['липовый', 'гречишный', 'цветочный', 'лесной', 'акациевый', 
            'донниковый', 'клеверный', 'подсолнечниковый', 'мятный', 
            'каштановый', 'горный', 'луговой', 'майский', 'июньский', 'августовский', 'весенний', 'осенний',
            'степной', 'таёжный', 'альпийский', 'полевой', 'садовый',
            'деревенский', 'падевый', 'эспарцетовый', 'фруктовый', 'ягодный', 'эвкалиптовый', 'лавадный', 'кедровый', 'сосновый', 'боярышниковый',
            'чертополоховый', 'одуванчиковый', 'шалфейный', 'лавандовый', 
            'розовый', 'апельсиновый', 'гранатовый', 'миндальный', 'ванильный', 'коричный', 'башкирский', 'алтайский', 'кавказский', 'карпатский', 'сибирский',
            'дальневосточный', 'крымский', 'кубанский', 'донской', 'волжский', 'тёмный', 'светлый', 'янтарный', 'прозрачный', 'кристаллизованный',
            'жидкий', 'густой', 'ароматный']
        
        for _ in range(1000):
            name = random.choice(types) + ' мёд'
            Honey.objects.create(name=name)